app/Controllers/News.php

    public function create() {
        $model = new NewsModel();
        if (
            $this->request->getMethod() === 'post' &&
            $this->validate([
                'title' => 'required|min_length[3]|max_length[255]',
                'body' => 'required'
                ])
        ) {
            $model->save([
                'title' => $this->request->getPost('title'),
                'slug' => url_title($this->request->getPost('title'), '-', TRUE),
                'body' => $this->request->getPost('body'),
            ]);
---
INSERT INTO `news` (`title`, `slug`, `body`) VALUES ('some-title-5', 'some-title-5', 'Woman presumed dead found alive in coffin at her wake in Ecuador')