app/Models/NewsModel.php

    public function getNews($slug = false) {
        if ($slug === false) {
            return $this->findAll();
        }
        return $this->asArray()
                    ->where(['slug' => $slug])
                    ->first();
---
SELECT *
FROM `news`
SELECT *
FROM `news`
WHERE `slug` = 'some-title-2'
 LIMIT 1